RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/triggers/cyhal_triggers_psoc6_02.c
const _cyhal_trigger_source_psoc6_02_t cyhal_mux5_sources[251] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW0_TR_OUT28,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT3,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT4,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT5,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT6,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT7,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT8,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT9,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT10,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT11,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT12,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT13,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT14,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT15,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT16,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT17,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT18,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT19,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT20,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT21,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT22,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT23,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT24,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT25,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT26,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT27,
    _CYHAL_TRIGGER_CPUSS_DW1_TR_OUT28,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW0,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH0,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW0,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW1,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH1,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW1,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW2,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH2,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW2,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW3,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH3,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW3,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW4,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH4,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW4,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW5,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH5,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW5,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW6,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH6,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW6,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW7,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH7,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH0,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH1,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH2,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH3,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH4,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH5,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH6,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH7,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW8,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH8,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW8,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW9,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH9,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW9,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW10,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH10,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW10,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW11,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH11,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW11,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW12,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH12,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW12,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW13,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH13,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW13,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW14,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH14,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW14,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW15,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH15,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW15,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW16,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH16,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW16,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW17,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH17,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW17,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW18,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH18,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW18,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW19,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH19,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW19,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW20,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH20,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW20,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW21,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH21,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW21,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW22,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH22,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW22,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW23,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH23,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW23,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT1,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT2,
    _CYHAL_TRIGGER_CPUSS_DMAC_TR_OUT3,
    _CYHAL_TRIGGER_SCB0_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB9_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB10_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB11_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB11_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB11_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB12_TR_I2C_SCL_FILTERED,
    _CYHAL_TRIGGER_SCB12_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB12_TR_RX_REQ,
    _CYHAL_TRIGGER_SMIF_TR_TX_REQ,
    _CYHAL_TRIGGER_SMIF_TR_RX_REQ,
    _CYHAL_TRIGGER_USB_DMA_REQ0,
    _CYHAL_TRIGGER_USB_DMA_REQ1,
    _CYHAL_TRIGGER_USB_DMA_REQ2,
    _CYHAL_TRIGGER_USB_DMA_REQ3,
    _CYHAL_TRIGGER_USB_DMA_REQ4,
    _CYHAL_TRIGGER_USB_DMA_REQ5,
    _CYHAL_TRIGGER_USB_DMA_REQ6,
    _CYHAL_TRIGGER_USB_DMA_REQ7,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS0_TR_PDM_RX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_TX_REQ,
    _CYHAL_TRIGGER_AUDIOSS1_TR_I2S_RX_REQ,
    _CYHAL_TRIGGER_CSD_DSI_SENSE_OUT,
    _CYHAL_TRIGGER_CSD_DSI_SAMPLE_OUT,
    _CYHAL_TRIGGER_CSD_TR_ADC_DONE,
    _CYHAL_TRIGGER_PASS_TR_SAR_OUT,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT0,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT1,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT2,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT3,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT4,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT6,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT7,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT8,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT9,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT10,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT11,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT12,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT13,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT14,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT15,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT16,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT17,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT18,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT19,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT20,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT21,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT22,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT23,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT24,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT25,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT26,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT27,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT0,
    _CYHAL_TRIGGER_CPUSS_TR_FAULT1,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT1,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP0,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP1,
};

const _cyhal_trigger_source_psoc6_02_t cyhal_mux6_sources[27] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH0,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH1,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH2,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH3,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH4,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH5,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH6,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH7,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW7,
    _CYHAL_TRIGGER_SMIF_TR_TX_REQ,
    _CYHAL_TRIGGER_SMIF_TR_RX_REQ,
};

const _cyhal_trigger_source_psoc6_02_t cyhal_mux7_sources[3] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT0,
    _CYHAL_TRIGGER_CPUSS_CTI_TR_OUT1,
};

const _cyhal_trigger_source_psoc6_02_t cyhal_mux8_sources[127] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW0,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH0,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW0,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW1,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH1,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW1,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW2,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH2,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW2,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW3,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH3,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW3,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW4,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH4,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW4,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW5,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH5,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW5,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW6,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH6,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW6,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW7,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH7,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH0,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH1,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH2,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH3,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH4,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH5,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH6,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH7,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW8,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH8,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW8,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW9,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH9,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW9,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW10,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH10,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW10,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW11,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH11,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW11,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW12,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH12,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW12,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW13,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH13,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW13,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW14,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH14,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW14,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW15,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH15,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW15,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW16,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH16,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW16,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW17,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH17,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW17,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW18,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH18,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW18,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW19,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH19,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW19,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW20,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH20,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW20,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW21,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH21,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW21,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW22,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH22,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW22,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW23,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH23,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW23,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT0,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT1,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT2,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT3,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT4,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT6,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT7,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT8,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT9,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT10,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT11,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT12,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT13,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT14,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT15,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT16,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT17,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT18,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT19,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT20,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT21,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT22,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT23,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT24,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT25,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT26,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT27,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP0,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP1,
};

const _cyhal_trigger_source_psoc6_02_t cyhal_mux9_sources[127] =
{
    _CYHAL_TRIGGER_CPUSS_ZERO,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW0,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH0,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW0,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW1,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH1,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW1,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW2,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH2,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW2,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW3,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH3,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW3,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW4,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH4,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW4,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW5,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH5,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW5,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW6,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH6,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW6,
    _CYHAL_TRIGGER_TCPWM0_TR_OVERFLOW7,
    _CYHAL_TRIGGER_TCPWM0_TR_COMPARE_MATCH7,
    _CYHAL_TRIGGER_TCPWM0_TR_UNDERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH0,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW0,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH1,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW1,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH2,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW2,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH3,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW3,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH4,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW4,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH5,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW5,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH6,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW6,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH7,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW7,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW8,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH8,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW8,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW9,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH9,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW9,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW10,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH10,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW10,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW11,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH11,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW11,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW12,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH12,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW12,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW13,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH13,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW13,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW14,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH14,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW14,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW15,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH15,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW15,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW16,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH16,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW16,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW17,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH17,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW17,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW18,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH18,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW18,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW19,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH19,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW19,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW20,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH20,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW20,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW21,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH21,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW21,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW22,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH22,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW22,
    _CYHAL_TRIGGER_TCPWM1_TR_OVERFLOW23,
    _CYHAL_TRIGGER_TCPWM1_TR_COMPARE_MATCH23,
    _CYHAL_TRIGGER_TCPWM1_TR_UNDERFLOW23,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT0,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT1,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT2,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT3,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT4,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT5,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT6,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT7,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT8,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT9,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT10,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT11,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT12,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT13,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT14,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT15,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT16,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT17,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT18,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT19,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT20,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT21,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT22,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT23,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT24,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT25,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT26,
    _CYHAL_TRIGGER_PERI_TR_IO_INPUT27,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP0,
    _CYHAL_TRIGGER_LPCOMP_DSI_COMP1,
};

const _cyhal_trigger_source_psoc6_02_t cyhal_mux10_sources[12] =
{
    _CYHAL_TRIGGER_SCB0_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB0_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB1_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB2_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB3_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB4_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB5_TR_RX_REQ,
};

const _cyhal_trigger_source_psoc6_02_t cyhal_mux11_sources[14] =
{
    _CYHAL_TRIGGER_SCB6_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB6_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB7_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB8_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB9_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB10_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB11_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB11_TR_RX_REQ,
    _CYHAL_TRIGGER_SCB12_TR_TX_REQ,
    _CYHAL_TRIGGER_SCB12_TR_RX_REQ,
};

